// Problem-01 : Train TT's Fine Calculator 
// ⚠️ Function Name Must be totalFine()
// ট্রেনের একজন TT হিসেবে কাজ করছেন রবিন। প্রতিদিন অসংখ্য যাত্রী টিকিট হারিয়ে ফেলেন কিংবা কাটেন ই না। টিকিটবিহীন যাত্রীদের জরিমানা করতে গিয়ে প্রতিবার ক্যালকুলেশন করতে অনেক সময় লাগে। তাই TT রবিনই জরিমানার নির্ভুল হিসাব চলে আসবে চায়, এমন একটি ফাংশন যেখানে যাত্রীর ট্রেন ভাড়া দিলে। 
// তুমি যেহেতু প্রোগ্রামার, তাই তোমাকে রবিন সাহেবের জন্য  totalFine নামে একটা function তৈরী করে দিতে হবে।  যেটা fare কে ইনপুট হিসেবে নেবে।  এবং fine ক্যালকুলেট করে return করবে।   
// 🧮 জরিমানা নির্ধারণের নিয়ম:
// মোট জরিমানা = টিকিটের মূল ভাড়া + (২০% সারচার্জ) + অতিরিক্ত ৩০ টাকা সার্ভিস চার্জ
// 📥 Input:
// ফাংশনটি  একটি পজিটিভ সংখ্যা(number) ইনপুট নেবে  


// 🚀 Output:
// Input এর  ওপর ভিত্তি করে ফাংশনটি মোট  জরিমানা হিসাব করে একটি সংখ্যা return করবে
// Output দশমিক সংখ্যা হতে পারে।
// Note: তোমাকে অবশ্যই output টা রিটার্ন করতে হবে।  console.log করলে কোন মার্ক পাবেনা


// 🚩Challenge:  
// যদি ইনপুট টি number না হয়  অথবা  পজিটিভ সংখ্যা না হয়  তাহলে  "Invalid"  স্ট্রিং  রিটার্ন করবে। 

// 💡Hints:  যদি ইনপুট 200  হয়, তাহলে fine হবে: 200 + 200 × (20 / 100) + 30 = 270 Taka

//Problem - 1

function totalFine(fare) {
    if (typeof fare !== 'number' || fare <= 0) {
        return "Invalid";
    }
    const fine = fare + fare * (20 / 100) + 30;
    return fine;
}
// const result = totalFine(20);
// console.log(result);


